Revit 2027 API
RoofComponents Methods
The RoofComponents type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetAreasOfCurveLoops |  The areas of CurveLoops of roof slabs.
GetCurveLoops |  The CurveLoops of roof slabs.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetLoopFaces |  The faces of the loops of roof slabs.
GetPlaneDirections |  The plane directions of roof slabs.
GetPlaneOrigins |  The plane origins of roof slabs.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
RoofComponents Class
Autodesk.Revit.DB.IFC Namespace